app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "DHR"], ["content", "DHR is SB"], ["created_at", "2017-11-01 14:18:26.455243"], ["updated_at", "2017-11-01 14:18:26.455243"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "DHR is BIg sb"], ["content", "DHR is SB"], ["updated_at", "2017-11-06 14:48:22.572726"], ["id", 3]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)